# IsDoubleValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..IsDoubleValue Property
ScheduleFilter Class See Also
---
Indicates if the filter has a double value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsDoubleValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDoubleValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDoubleValue {
	bool get ();
}
```

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace